app/views/product_items/new_entry.html.erb

SELECT "warehouses".* FROM "warehouses"
---
    <%= f.select :warehouse_id, options_from_collection_for_select(@warehouses, :id, :code) %> <%# select um pouco mais trabalhoso %>
  </div>                                                                                       <%# @warehouses substitui Warehouses.all devido a declaração dele no controller new_entry%>