app/views/product_models/edit.html.erb

SELECT "suppliers".* FROM "suppliers"
---
    <%= form.label :supplier_id, 'Fornecedor' %>
    <%= form.collection_select(:supplier_id, Supplier.all, :id, :ficname ) %>

SELECT "categories".* FROM "categories"
---
  <%= form.label :category_id, 'Categoria do Produto' %>
    <%= form.collection_select(:category_id, Category.all, :id, :name ) %>