app/views/product_models/new.html.erb

    <%= form.label :supplier_id, 'Fornecedor' %>
    <%= form.collection_select(:supplier_id, Supplier.all, :id, :ficname ) %>
---
SELECT "suppliers".* FROM "suppliers"

  <%= form.label :category_id, 'Categoria do Produto' %>
    <%= form.collection_select(:category_id, Category.all, :id, :name ) %>
---
SELECT "categories".* FROM "categories"