app/views/product_models/show.html.erb


<% @items = @product_model.product_items.group(:product_model).count %>
---
SELECT COUNT(*) AS "count_all", "product_items"."product_model_id" AS "product_items_product_model_id" FROM "product_items" WHERE "product_items"."product_model_id" = ? GROUP BY "product_items"."product_model_id"  [["product_model_id", 1]]