app/views/product_bundles/new.html.erb

SELECT "product_models".* FROM "product_models"
---
    <h2>Escolha os produtos do seu KIT</h2>
  <%= f.collection_check_boxes :product_model_ids, ProductModel.all, :id, :name%>