app/controllers/api/v1/product_models_controller.rb

SELECT "product_models".* FROM "product_models"
---
  def index
    @product_models = ProductModel.all

SELECT "product_models".* FROM "product_models" WHERE "product_models"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @product_model = ProductModel.find(params[:id])

INSERT INTO "product_models" ("name", "weight", "height", "length", "width", "sku", "supplier_id", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    paramters_product_model = params.permit(:name, :sku, :weight, :width, :length,
                                            :height, :supplier_id, :category_id)
    @product_model = ProductModel.new(paramters_product_model)
    if @product_model.save