app/controllers/api/v1/suppliers_controller.rb

SELECT "suppliers".* FROM "suppliers"
---
  def index
    @suppliers = Supplier.all

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @supplier = Supplier.find(params[:id])

INSERT INTO "suppliers" ("namesoc", "ficname", "email", "cnpj", "tel", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    paramters_supplier = params.permit(:namesoc, :ficname, :address, :email, :cnpj, :tel)
    @supplier = Supplier.new(paramters_supplier)
    if @supplier.save