app/controllers/api/v1/warehouses_controller.rb

INSERT INTO "warehouses" ("name", "code", "created_at", "updated_at", "description", "address", "postal_code", "city", "state", "total_area", "useful_area") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    paramters_w = params.permit(:name, :code, :address, :state, :city,
                                :postal_code, :description, :useful_area,
                                :total_area, category_ids: [])
    @warehouse = Warehouse.new(paramters_w)
    if @warehouse.save