app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @category = Category.find(id)

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Moda Masculina"], ["created_at", "2021-12-23 20:31:31.397869"], ["updated_at", "2021-12-23 20:31:31.397869"]]
---
  def create
    category_params = params.require(:category).permit(:name)
    @category = Category.new(category_params)
    if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]
---
  def destroy
    @category = Category.find(params[:id])
    @category.delete