app/controllers/product_models_controller.rb

  def index
    @product_models = ProductModel.all
---
SELECT "product_models".* FROM "product_models"

  def show
    id = params[:id]
    @product_model = ProductModel.find(id)
---
SELECT "product_models".* FROM "product_models" WHERE "product_models"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]

  def create
    product_model_params = params.require(:product_model).permit(:name, :sku, :weight, :width, :length, :height,
                                                                 :supplier_id, :category_id, :status)
    @product_model = ProductModel.new(product_model_params)
    if @product_model.save
---
INSERT INTO "product_models" ("name", "weight", "height", "length", "width", "sku", "supplier_id", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @product_model = ProductModel.find(params[:id])
---
SELECT "product_models".* FROM "product_models" WHERE "product_models"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @product_model = ProductModel.find(params[:id])
    @product_model.update(params.require(:product_model).permit(:name, :sku, :weight, :width, :length, :height,
                                                                :supplier_id, :category_id, :status))
---
SELECT "product_models".* FROM "product_models" WHERE "product_models"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "product_models" SET "sku" = ?, "updated_at" = ?, "category_id" = ? WHERE "product_models"."id" = ?  [["sku", "asda"], ["updated_at", "2021-12-28 16:50:54.700422"], ["category_id", 1], ["id", 3]]

  def in
    @product_model = ProductModel.find(params[:id])
---
SELECT "product_models".* FROM "product_models" WHERE "product_models"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def out
    @product_model = ProductModel.find(params[:id])
---
SELECT "product_models".* FROM "product_models" WHERE "product_models"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]