app/controllers/product_bundles_controller.rb

SELECT "product_bundles".* FROM "product_bundles" WHERE "product_bundles"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @product_bundle = ProductBundle.find(id)

INSERT INTO "product_bundles" ("name", "sku", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "PRODUTOS"], ["sku", "9682c913a361012b74168f3d"], ["created_at", "2021-12-28 16:15:05.283733"], ["updated_at", "2021-12-28 16:15:05.283733"]]
---
  def create
    bundle_params = params.require(:product_bundle).permit(:name, :sku, product_model_ids: [])
    @product_bundle = ProductBundle.new(bundle_params)
    if @product_bundle.save