app/controllers/suppliers_controller.rb

  def index
    @suppliers = Supplier.all
---
SELECT "suppliers".* FROM "suppliers"

  def show
    id = params[:id]
    @supplier = Supplier.find(id)
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    supplier_params = params.require(:supplier).permit(:namesoc, :ficname, :address, :email, :cnpj, :tel)
    @supplier = Supplier.new(supplier_params)
    if @supplier.save
---
INSERT INTO "suppliers" ("namesoc", "ficname", "email", "cnpj", "tel", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @supplier = Supplier.find(params[:id])
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @supplier = Supplier.find(params[:id])
    @supplier.update(params.require(:supplier).permit(:namesoc, :ficname, :address, :email, :cnpj, :tel))
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "suppliers" SET "namesoc" = ?, "ficname" = ?, "updated_at" = ? WHERE "suppliers"."id" = ?  [["namesoc", "Amazon Serviços de Varejo S/A"], ["ficname", "Amazon S/A"], ["updated_at", "2021-12-28 21:13:43.560103"], ["id", 3]]

  def destroy
    @supplier = Supplier.find(params[:id])
    @supplier.delete
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "suppliers" WHERE "suppliers"."id" = ?  [["id", 3]]