app/controllers/warehouses_controller.rb

INSERT INTO "warehouses" ("nome", "code", "created_at", "updated_at", "description", "adress", "postal_code", "city", "state", "total_area", "useful_area") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    warehouse_params = params.require(:warehouse).permit(:nome, :code, :adress, :state, :city,
                                      :postal_code, :description, :useful_area,
                                      :total_area )
   @warehouse = Warehouse.new(warehouse_params)
    if @warehouse.save()

UPDATE "warehouses" SET "updated_at" = ?, "postal_code" = ?, "city" = ?, "state" = ?, "total_area" = ?, "useful_area" = ? WHERE "warehouses"."id" = ?  [["updated_at", "2021-12-23 20:01:41.023290"], ["postal_code", "77777-777"], ["city", "Metafísica"], ["state", "Nietszche é Otário"], ["total_area", 777], ["useful_area", 7777], ["id", 10]]
---
  def update
    @warehouse = Warehouse.find(params[:id])
    @warehouse.update(params.require(:warehouse).permit(:nome, :code, :adress, :state, :city,
                                                        :postal_code, :description, :useful_area,
                                                        :total_area))