app/controllers/warehouses_controller.rb

SELECT "categories".* FROM "categories" INNER JOIN "category_warehouses" ON "categories"."id" = "category_warehouses"."category_id" WHERE "category_warehouses"."warehouse_id" = ?  [["warehouse_id", 1]]
---
  def show
    id = params[:id]
    @warehouse = Warehouse.find(id)
    @product_models = ProductModel.where(category: @warehouse.categories)

DELETE FROM "warehouses" WHERE "warehouses"."id" = ?  [["id", 1]]
---
  def destroy
    @warehouse = Warehouse.find(params[:id])
    @warehouse.delete