app/views/categories/show.html.erb


<% @category.product_models.each do |p|%>
---
SELECT "product_models".* FROM "product_models" WHERE "product_models"."category_id" = ?  [["category_id", 1]]