app/views/suppliers/show.html.erb

SELECT "product_models".* FROM "product_models" WHERE "product_models"."supplier_id" = ?  [["supplier_id", 3]]
---
</tr>
<%@supplier.product_models.each do |p|%>