app/views/warehouses/edit.html.erb

  <h2>Escolha as categorias de produtos armazenáveis</h2>
  <%= form.collection_check_boxes :category_ids, Category.all, :id, :name%>
---
SELECT "categories".* FROM "categories"