app/views/warehouses/show.html.erb

  <dt> Categorias de Produtos do Galpão: </dt>
  <% @warehouse.categories.each do |w| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "category_warehouses" ON "categories"."id" = "category_warehouses"."category_id" WHERE "category_warehouses"."warehouse_id" = ?  [["warehouse_id", 1]]


<% @items = @warehouse.product_items.group(:product_model).count %> <%#pegue todos os product itens, group por product_model e count quantos product models%>
---
SELECT COUNT(*) AS "count_all", "product_items"."product_model_id" AS "product_items_product_model_id" FROM "product_items" WHERE "product_items"."warehouse_id" = ? GROUP BY "product_items"."product_model_id"  [["warehouse_id", 1]]